instagram_app/app/views/articles/index.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["user_id", 2], ["article_id", 27], ["LIMIT", 1]]
---
              <div class="likes-btn">
                <% if Like.find_by(user_id: current_user.id, article_id: article.id) %>