recipe_app/app/views/users/likes.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 9], ["LIMIT", 1]]
---
        <% @likes.each do |like| %>
        <% post = Post.find_by(id: like.post_id) %>
        <% @likes_count = Like.where(post_id: post.id).count %>

SELECT "users".* FROM "users" WHERE "users"."user_id" = ?  [["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 9], ["LIMIT", 1]]
---
            <div class="recipe-likes">
              <% if Like.find_by(user_id:current_user.id,post_id:post.id) %>