recipe_app/app/views/posts/index.html.erb

              <p><%= post.content %></p>
              <% post.foods.each do |food| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."post_id" = ?  [["post_id", 7]]

            <div class="recipe-likes">
              <% if Like.find_by(user_id:current_user.id,post_id:post.id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 7], ["LIMIT", 1]]