recipe_app/app/views/posts/ranking.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]
---
        <% num = 0 %>
        <% @all_ranks = Post.find(Like.group(:post_id).order('count(post_id) desc').pluck(:post_id)) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 8]]
---
            <a href="/posts/<%= post.id %>"><%= post.name %></a>
              <p><%= Like.where(post_id:post.id).count %>人がいいねしています</p>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 8], ["LIMIT", 1]]
---
            <div class="recipe-likes">
              <% if Like.find_by(user_id:current_user.id,post_id:post.id) %>