recipe_app/app/views/posts/search.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."post_id" = ?  [["post_id", 9]]
---
              <p><%= post.content %></p>
              <% post.foods.each do |food| %>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 9], ["LIMIT", 1]]
---
            <div class="recipe-likes">
              <% if Like.find_by(user_id:current_user.id,post_id:post.id) %>