recipe_app/app/views/posts/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 7], ["LIMIT", 1]]
---
            <div class="show-likes_icon">
            <% if Like.find_by(user_id:current_user.id,post_id:@post.id) %>

SELECT "foods".* FROM "foods" WHERE "foods"."post_id" = ?  [["post_id", 7]]
---
            <tr>
            <% @post.foods.each do |food| %>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."post_id" = ?  [["post_id", 7]]
---
          <div class="show-process grid-show">
            <% @post.recipes.each do |recipe| %>