work_time/app/views/works/_form.html.erb

SELECT "categories"."id" FROM "categories"
---
    <div class='col-sm-10'>
      <%= form.select :category_id, Category.all.map{|o| [o.name, o.id]} %>