work_time/app/views/works/index.html.erb

SELECT "users".* FROM "users"
---
  <%= label_tag(:name_key, '名前:　　') %>
  <%= select_tag :name_key,
  options_for_select(
    User.all.map {|o| [ "#{o.name}" , o.id ] }),include_blank: true %>

SELECT "categories".* FROM "categories"
---
  <%= label_tag(:category_key, '仕事内容:') %>
  <%= select_tag :category_key,
  options_for_select(
    Category.all.map {|c| [ "#{c.name}" , c.id ] }),include_blank: true  %>