instagram_app/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "users".* FROM "users"
---
  def index
    @articles = Article.all
    @users = User.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 27]]
---
  def show
    @article = Article.find_by(id: params[:id])
    @user = User.find_by(id: @article.user_id)
    @likes_count = Like.where(article_id: @article.id).count

INSERT INTO "articles" ("user_id", "image", "body", "created_at", "updated_at", "image2") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["image", "images__1_.jpg"], ["body", "dd"], ["created_at", "2020-12-02 12:58:39.159115"], ["updated_at", "2020-12-02 12:58:39.159115"], ["image2", "ダウンロード__1_.jpg"]]
---
  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    respond_to do |format|
      if @article.save

UPDATE "articles" SET "image" = ?, "image2" = ?, "image3" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image", "foodie_img.jpg"], ["image2", "paris-1.jpg"], ["image3", "cola.jpg"], ["updated_at", "2020-12-03 06:00:11.659902"], ["id", 27]]
---
  def update
    if @article.user_id == current_user.id
      respond_to do |format|
        if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 15]]
---
  def destroy
    if @article.user_id == current_user.id
      @article.destroy