instagram_app/app/controllers/likes_controller.rb

  def create
    @like = Like.new(user_id: current_user.id, article_id: params[:article_id])
    @like.save
---
INSERT INTO "likes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["article_id", 27], ["created_at", "2020-12-04 14:18:43.683974"], ["updated_at", "2020-12-04 14:18:43.683974"]]

  def destroy
    @like =Like.find_by(user_id: current_user.id, article_id: params[:article_id])
    @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["user_id", 2], ["article_id", 27], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]