instagram_app/app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
    @articles = Article.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]

  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 2]]