todo_list/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @post = Post.all

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "あああ"], ["created_at", "2020-11-16 08:05:05.720017"], ["updated_at", "2020-11-16 08:05:05.720017"]]
---
  def create
    @post = Post.new(content: params[:content])
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ああ\r\n"], ["updated_at", "2020-11-17 05:16:39.604821"], ["id", 7]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy