recipe_app/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "cook_image", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "おいしくできました"], ["cook_image", "roo.images.jpg"], ["user_id", 1], ["post_id", 9], ["created_at", "2021-01-12 09:20:26.008899"], ["updated_at", "2021-01-12 09:20:26.008899"]]