recipe_app/app/controllers/posts_controller.rb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]
---
  def show
    @likes_count = Like.where(post_id:@post.id).count

INSERT INTO "posts" ("user_id", "name", "posts_image", "content", "point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "point" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "本格的なインドカレーです。\r\nご家庭でぜひ！！！"], ["point", "よく煮込むこと。\r\n煮込むときにこげないようにしましょう"], ["updated_at", "2021-01-09 07:15:00.559260"], ["id", 7]]
---
  def update
    if @post.user_id == current_user.id
      respond_to do |format|
        if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
  def destroy
    if @post.user_id == current_user.id
      @post.destroy

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def ranking
    @posts = Post.all.order(created_at: :desc)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "posts".* FROM "posts" INNER JOIN "foods" ON "foods"."post_id" = "posts"."id" WHERE (name LIKE '%カレー%' OR content LIKE '%カレー%' OR m_name LIKE '%カレー%')
SELECT "posts".* FROM "posts" INNER JOIN "foods" ON "foods"."post_id" = "posts"."id" WHERE (name LIKE '%カレー%' OR content LIKE '%カレー%' OR m_name LIKE '%カレー%') AND NOT (name LIKE '%含まない%' OR content LIKE '%含まない%' OR m_name LIKE '%含まない%')
---
  def search
    if params[:id_keyword]
      @posts = Post.where(id: params[:id_keyword] )
    else
      @posts = Post.all.order(created_at: :desc)
    end
    if params[:keyword]
        keywords = params[:keyword].split(/[[:blank:]]+/).select(&:present?)
        notkeywords = params[:notkeyword].split(/[[:blank:]]+/).select(&:present?)
        keywords.each do |keyword|
          @posts = Post.joins(:foods).where(["name LIKE ? OR content LIKE ? OR m_name LIKE ?", "%#{keyword}%", "%#{keyword}%", "%#{keyword}%"]).uniq
          notkeywords.each do |notkeyword|
          @posts = Post.joins(:foods).where(["name LIKE ? OR content LIKE ? OR m_name LIKE ?", "%#{keyword}%", "%#{keyword}%", "%#{keyword}%"]).where.not(["name LIKE ? OR content LIKE ? OR m_name LIKE ?", "%#{notkeyword}%", "%#{notkeyword}%", "%#{notkeyword}%"]).uniq