recipe_app/app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @post = Post.find_by(id: params[:id])
    @material = Material.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "materials".* FROM "materials" WHERE "materials"."post_id" = ?  [["post_id", 5]]