recipe_app/app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
    @posts = @user.posts.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]