instagram_app/app/views/users/index.html.erb

          <% if user_signed_in? %>
            <% User.all.where.not(id: current_user.id).each do |user| %>
---
SELECT "users".* FROM "users"