instagram_app/app/views/users/likes.html.erb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
      <% @likes.each do |like| %>
        <% article = Article.find_by(id: like.article_id) %>

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["user_id", 2], ["article_id", 29], ["LIMIT", 1]]
---
          <div class="likes-btn">
            <% if Like.find_by(user_id: current_user.id, article_id: article.id) %>