instagram_app/app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
    <div class="user_article grid">
      <% @user.articles.each do |article| %>