instagram_app/app/models/article.rb

  def user
    return User.find_by(id: self.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]