work_time/app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "出品"], ["created_at", "2020-11-19 05:52:05.930371"], ["updated_at", "2020-11-19 05:52:05.930371"]]

  def destroy
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]