work_time/app/controllers/works_controller.rb

  def index
    if params[:name_key] || params[:category_key]
      @works = Work.where('date LIKE ?', "%#{params[:name_key]}%").where('category_id LIKE ?', "%#{params[:category_key]}%")
    else
      @works = Work.all
---
SELECT "works".* FROM "works" WHERE (date like '%2011-11%') AND "works"."category_id" = ?  [["category_id", "1"]]
SELECT "works".* FROM "works"

  def create
    @work = Work.new(work_params)

    respond_to do |format|
      if @work.save
---
INSERT INTO "works" ("date", "category_id", "count", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-11-23"], ["category_id", 12], ["count", 80], ["created_at", "2020-11-23 06:32:47.863680"], ["updated_at", "2020-11-23 06:32:47.863680"], ["user_id", 2]]

  def destroy
    @work.destroy
---
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 1]]

    def set_work
      @work = Work.find(params[:id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]