recipe_app/app/models/post.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def user
    return User.find_by(id: self.user_id)